Conf.Simple/src/InformationRegisters/SUI_СообщенияОбменаДанными/SUI_СообщенияОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СообщенияОбменаДанными</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ВидДанных</name>
    <type>
      <types>EnumRef.SUI_ВидыДанныхСообщенийОбменаДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сворачивать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбрабатывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозврата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторВозврата</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <comment>Идентификатор сообщения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_СостоянияМобильныхУстройств/SUI_СостоянияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СостоянияМобильныхУстройств</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияМобильныхУстройств</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными/SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными</name>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КраткоеПредставлениеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПодробноеПредставлениеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОбменаДанными</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ВидыДанныхСообщенийОбменаДанными/SUI_ВидыДанныхСообщенийОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ВидыДанныхСообщенийОбменаДанными</name>
  <enumValues>
    <name>Значение</name>
  </enumValues>
  <enumValues>
    <name>JSON</name>
  </enumValues>
  <enumValues>
    <name>XML</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_СостоянияМобильныхУстройств/SUI_СостоянияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СостоянияМобильныхУстройств</name>
  <enumValues>
    <name>ЗапросПолнойВыгрузки</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДанных</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПолучитьДанные</name>
  </enumValues>
  <enumValues>
    <name>Выгружено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/CommonModules/SUI_СообщенияОбменаДанными/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьСообщениеДляМобильногоУстройства(МобильноеУстройство, ВПривилегированномРежиме = Ложь) Экспорт
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительностиПереопределяемый.НачатьЗамерВремени();
	ОценкаПроизводительности_ВесЗамера = 0;
	ОценкаПроизводительности_КлючеваяОперация = "ПолучитьСообщениеДляМобильногоУстройства";
	
	Если ВПривилегированномРежиме И Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ДанныеВозврата = Новый Структура();
	ДанныеВозврата.Вставить("Данные", SUI_ПакетыДанныхКлиентСервер.ПустойПакет(SUI_ПакетыДанныхКлиентСервер.ФорматПакета_НетДанных()));
	ДанныеВозврата.Вставить("ОстатокПакетов", 0);
	
	ДанныеСообщения = РегистрыСведений.SUI_СообщенияОбменаДанными.ПолучитьПервоеСообщениеПоПолучателю(МобильноеУстройство);
	
	Если ДанныеСообщения <> Неопределено Тогда
		
		ОценкаПроизводительности_ВесЗамера = 1;
		
		НачатьТранзакцию();
		
		Попытка
			
			ОбщегоНазначенияКлиентСервер.Проверить(
				ДанныеСообщения.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение Или
				ДанныеСообщения.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON,
				НСтр("ru = 'Не реализовано'"));
			
			// Собрать сообщение пакет JSON, если вид данных сообщения = Значение
			Если ДанныеСообщения.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение Тогда
				
				ПараметрыСборки = SUI_ПакетыДанных.ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(ДанныеСообщения.Данные);
				ЗаполнитьЗначенияСвойств(ПараметрыСборки, ДанныеСообщения);
				ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON;
				
				// Собрать в JSON
				Пакеты = SUI_ПакетыДанных.СобратьСообщениеПакетаДанныхИзКоллекции(ПараметрыСборки);
				
				ОбщегоНазначенияКлиентСервер.Проверить(Пакеты.Количество() > 0,
					НСтр("ru = 'Не удалось собрать пакет данных'"));
				
				ДанныеВозврата.Данные = Пакеты[0];
				
				// Записать остатки пакетов
				Для индекс = 1 По Пакеты.ВГраница() Цикл
					РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, 
						ПараметрыСборки.Получатель, Пакеты[индекс], ПараметрыСборки.Приоритет, ПараметрыСборки.ВидДанных,
						Новый Структура("МеткаВремени, ДатаЗаписи, Сворачивать", ДанныеСообщения.МеткаВремени+1, ДанныеСообщения.ДатаЗаписи, Ложь));
				КонецЦикла;
				
			Иначе
				ДанныеВозврата.Данные = ДанныеСообщения.Данные;
			КонецЕсли;
			
			// Удалить полученное сообщение
			РегистрыСведений.SUI_СообщенияОбменаДанными.Удалить(ДанныеСообщения.ID, ДанныеСообщения.Отправитель, ДанныеСообщения.Получатель);
			
			// Заполнить остаток сообщений
			ДанныеВозврата.ОстатокПакетов = РегистрыСведений.SUI_СообщенияОбменаДанными
				.ПолучитьКоличествоСообщенийПоМобильнымУстройствам(, ДанныеСообщения.Получатель);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(
				ОценкаПроизводительности_КлючеваяОперация, 
				ОценкаПроизводительности_НачалоЗамера, 
				ОценкаПроизводительности_ВесЗамера, 
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), 
				Истина);
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
	// Оценка производительности
	Если ОценкаПроизводительности_ВесЗамера > 0 Тогда
		SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, ОценкаПроизводительности_ВесЗамера);
	КонецЕсли;
	
	Возврат ДанныеВозврата;
	
КонецФункции

// Сжать строку.
// 
// Параметры:
//  Строка - Строка - Строка для сжатия
// 
// Возвращаемое значение:
//  Произвольный - Сжатая строка
Функция СжатьСтроку(Строка) Экспорт
	
	Результат = Неопределено;
	
	Если Не ПустаяСтрока(ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Строка)) Тогда
		Результат = XMLСтрока(Новый ХранилищеЗначения(Строка, Новый СжатиеДанных(9)));
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Результат);
	
КонецФункции

// Восстановить сжатую строку.
// 
// Параметры:
//  Строка - Строка - Строка сжатая функцией см. SUI_СообщенияОбменаДанными.СжатьСтроку
// 
// Возвращаемое значение:
//  Произвольный - Восстановленая строка
Функция ВосстановитьСжатуюСтроку(Строка) Экспорт
	
	Результат = Неопределено;
	
	Если Не ПустаяСтрока(ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Строка)) Тогда
		Результат = XMLЗначение(Тип("ХранилищеЗначения"), Строка).Получить();
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Результат);
	
КонецФункции

// Создать входящие сообщение.
// 
// Параметры:
//  Отправитель - ПланОбменаСсылка.SUI_МобильныеУстройства - Отправитель
//  ИмяМетода - Строка - Имя экспортной процедуры обработки входящего сообщения
//  ПараметрыМетода - Массив из Произвольный - Параметры экспортной процедуры обработки входящего сообщения
//  ДополнительныеПараметры - Структура, Неопределено - Дополнительные параметры создания сообщения обмена данными
// 
// Возвращаемое значение:
//  Строка, Неопределено - Идентификатор созданного сообщения обмена данными или Неопределено
Функция СоздатьВходящиеСообщение(Отправитель, ИмяМетода, ПараметрыМетода, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
	
	ДанныеСообщения = Новый Структура();
	ДанныеСообщения.Вставить("destination", ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(ИмяМетода));
	ДанныеСообщения.Вставить("params", Новый ФиксированныйМассив(ОписаниеТипаМассив.ПривестиЗначение(ПараметрыМетода)));
	
	Возврат РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(
		Отправитель, 
		ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел(),
		ОбщегоНазначения.ЗначениеВСтрокуXML(Новый ФиксированнаяСтруктура(ДанныеСообщения)), ,
		Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.XML);
	
КонецФункции

#Область JSON

Функция ДанныеСообщенияВJSON(ДанныеСообщения) Экспорт
	
	ТипЗначения = ТипЗнч(ДанныеСообщения);
	
	Если ТипЗначения = Тип("Массив") Или ТипЗначения = Тип("ФиксированныйМассив") Или
		ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("ФиксированнаяСтруктура") Или
		ТипЗначения = Тип("Соответствие") Или ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, ДанныеСообщения, , "ПреобразованиеДанныхJSON", SUI_СообщенияОбменаДанными);
		
		Возврат ЗаписьJSON.Закрыть();
		
	ИначеЕсли ТипЗначения = Тип("Строка") И 
		(СтрНачинаетсяС(ДанныеСообщения, "[") Или СтрНачинаетсяС(ДанныеСообщения, "{")) И 
		(СтрЗаканчиваетсяНа(ДанныеСообщения, "]") Или СтрЗаканчиваетсяНа(ДанныеСообщения, "}")) Тогда
		Возврат ДанныеСообщения;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ДанныеСообщенияИзJSON(Знач ДанныеСообщения) Экспорт
	
	ДанныеСообщения = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(ДанныеСообщения);
	
	Если (СтрНачинаетсяС(ДанныеСообщения, "[") Или СтрНачинаетсяС(ДанныеСообщения, "{")) И
		(СтрЗаканчиваетсяНа(ДанныеСообщения, "]") Или СтрЗаканчиваетсяНа(ДанныеСообщения, "}")) Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ДанныеСообщения);
		Возврат ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Null") Или ТипЗначения = Тип("Неопределено") Тогда
		Возврат Неопределено;
	ИначеЕсли ТипЗначения <> Тип("Строка") И ТипЗначения <> Тип("Число") И 
		ТипЗначения <> Тип("Булево") И ТипЗначения <> Тип("Дата") И
		ТипЗначения <> Тип("Массив") И ТипЗначения <> Тип("ФиксированныйМассив") И
		ТипЗначения <> Тип("Соответствие") И ТипЗначения <> Тип("ФиксированноеСоответствие") И
		ТипЗначения <> Тип("Структура") И ТипЗначения <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат Строка(Значение);
	КонецЕсли;
	
КонецФункции

Процедура ВыполнитьОбработкуСообщенийОбменаДанными() Экспорт
	
	// Обработать входящие сообщения
	ОбработатьВходящиеСообщения();
	
	// Обработать исходящие сообщения
	СформироватьИсходящиеСообщения();
	
КонецПроцедуры

Процедура ВыполнитьСверткуСообщенийОбменаДанными() Экспорт
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительностиПереопределяемый.НачатьЗамерВремени();
	ОценкаПроизводительности_ВесЗамера = 0;
	ОценкаПроизводительности_КлючеваяОперация = "ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтатистикаСообщенийОбмена.МобильноеУстройство КАК МобильноеУстройство,
		|	СтатистикаСообщенийОбмена.Приоритет КАК Приоритет
		|ИЗ
		|	(ВЫБРАТЬ
		|		СообщенияОбменаДанными.Получатель КАК МобильноеУстройство,
		|		СообщенияОбменаДанными.Приоритет КАК Приоритет,
		|		КОЛИЧЕСТВО(СообщенияОбменаДанными.ID) КАК КоличествоСообщений
		|	ИЗ
		|		РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СостоянияМобильныхУстройств КАК СостоянияМобильныхУстройств
		|			ПО СообщенияОбменаДанными.Получатель = СостоянияМобильныхУстройств.МобильноеУстройство
		|	ГДЕ
		|		СообщенияОбменаДанными.Сворачивать
		|		И СообщенияОбменаДанными.ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.Значение)
		|		И СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|		И ВЫБОР
		|			КОГДА СостоянияМобильныхУстройств.Состояние ЕСТЬ NULL
		|			ИЛИ СостоянияМобильныхУстройств.Состояние В (&СостоянияМобильныхУстройствДляСвертки)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	СГРУППИРОВАТЬ ПО
		|		СообщенияОбменаДанными.Получатель,
		|		СообщенияОбменаДанными.Приоритет) КАК СтатистикаСообщенийОбмена
		|ГДЕ
		|	СтатистикаСообщенийОбмена.КоличествоСообщений > 1";
	
	Запрос.УстановитьПараметр("СостоянияМобильныхУстройствДляСвертки", СостоянияМобильныхУстройствДляСвертки());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		// Оценка производительности
		ОценкаПроизводительности_ВесЗамера = Выборка.Количество();
		
		Пока Выборка.Следующий() Цикл
			
			НачатьТранзакцию();
			
			Попытка
				
				Блокировка = Новый БлокировкаДанных();
				ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.SUI_МобильныеУстройства");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.МобильноеУстройство);
				Блокировка.Заблокировать();
				
				// Свернуть сообщения
				//@skip-check query-in-loop
				СвернутьСообщенияОбменаДанными(
					Новый Структура("МобильноеУстройство, Приоритет", Выборка.МобильноеУстройство, Выборка.Приоритет), 
					Неопределено);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				ОтменитьТранзакцию();
				SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Свертка сообщений'")), , 
					Метаданные.ОбщиеМодули.SUI_СообщенияОбменаДанными, Выборка.МобильноеУстройство, ИнформацияОбОшибке());
				SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(
					ОценкаПроизводительности_КлючеваяОперация, 
					ОценкаПроизводительности_НачалоЗамера, 
					ОценкаПроизводительности_ВесЗамера, 
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), 
					Истина);
				ВызватьИсключение;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Оценка производительности
	Если ОценкаПроизводительности_ВесЗамера > 0 Тогда
		SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, ОценкаПроизводительности_ВесЗамера);
	КонецЕсли;
	
КонецПроцедуры

Процедура СвернутьСообщенияОбменаДанными(Параметры, АдресРезультата) Экспорт
	
	МаксимальныйРазмерПакета = SUI_ПакетыДанных.РазмерПакетаДанных();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	SUI_СообщенияОбменаДанными.ID КАК ID,
		|	SUI_СообщенияОбменаДанными.Отправитель КАК Отправитель,
		|	SUI_СообщенияОбменаДанными.Получатель КАК Получатель,
		|	SUI_СообщенияОбменаДанными.Данные КАК Данные,
		|	SUI_СообщенияОбменаДанными.ВидДанных КАК ВидДанных,
		|	SUI_СообщенияОбменаДанными.ДатаЗаписи КАК ДатаЗаписи,
		|	SUI_СообщенияОбменаДанными.МеткаВремени КАК МеткаВремени,
		|	SUI_СообщенияОбменаДанными.Приоритет КАК Приоритет,
		|	SUI_СообщенияОбменаДанными.Сворачивать КАК Сворачивать
		|ИЗ
		|	(ВЫБРАТЬ
		|		СообщенияОбменаДанными.Получатель КАК МобильноеУстройство,
		|		СообщенияОбменаДанными.Приоритет КАК Приоритет,
		|		КОЛИЧЕСТВО(СообщенияОбменаДанными.ID) КАК КоличествоСообщений
		|	ИЗ
		|		РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СостоянияМобильныхУстройств КАК СостоянияМобильныхУстройств
		|			ПО СообщенияОбменаДанными.Получатель = СостоянияМобильныхУстройств.МобильноеУстройство
		|	ГДЕ
		|		СообщенияОбменаДанными.Сворачивать
		|		И СообщенияОбменаДанными.ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.Значение)
		|		И СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|		И СообщенияОбменаДанными.Получатель = &МобильноеУстройство
		|		И СообщенияОбменаДанными.Приоритет = &Приоритет
		|		И ВЫБОР
		|			КОГДА СостоянияМобильныхУстройств.Состояние ЕСТЬ NULL
		|			ИЛИ СостоянияМобильныхУстройств.Состояние В (&СостоянияМобильныхУстройствДляСвертки)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	СГРУППИРОВАТЬ ПО
		|		СообщенияОбменаДанными.Получатель,
		|		СообщенияОбменаДанными.Приоритет) КАК СтатистикаСообщенийОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СообщенияОбменаДанными КАК SUI_СообщенияОбменаДанными
		|		ПО (СтатистикаСообщенийОбмена.КоличествоСообщений > 1
		|		И SUI_СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|		И СтатистикаСообщенийОбмена.МобильноеУстройство = SUI_СообщенияОбменаДанными.Получатель
		|		И СтатистикаСообщенийОбмена.Приоритет = SUI_СообщенияОбменаДанными.Приоритет
		|		И SUI_СообщенияОбменаДанными.Сворачивать
		|		И SUI_СообщенияОбменаДанными.ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.Значение))
		|
		|УПОРЯДОЧИТЬ ПО
		|	МеткаВремени";
	
	Запрос.УстановитьПараметр("СостоянияМобильныхУстройствДляСвертки", СостоянияМобильныхУстройствДляСвертки());
	Запрос.УстановитьПараметр("МобильноеУстройство", Параметры.МобильноеУстройство);
	Запрос.УстановитьПараметр("Приоритет", Параметры.Приоритет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока Не РезультатЗапроса.Пустой() Цикл
			
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_СообщенияОбменаДанными");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Отправитель", "Отправитель");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Получатель", "Получатель");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Количество() <> 2 Тогда
				Прервать;
			КонецЕсли;
			
			// Сообщение Источник
			Выборка.Следующий();
			ДанныеСообщенияИсточник = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
			ДанныеСообщенияИсточник.Данные = ДанныеСообщенияИсточник.Данные.Получить();
			
			// Сообщение Приемник
			Выборка.Следующий();
			ДанныеСообщенияПриемник = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
			ДанныеСообщенияПриемник.Данные = ДанныеСообщенияПриемник.Данные.Получить();
			
			// Свернуть коллекции
			SUI_ПакетыДанных.СвернутьКоллекцииДанных(ДанныеСообщенияИсточник.Данные, ДанныеСообщенияПриемник.Данные);
			
			// Подсчитать размер данных
			РазмерДанных = 0;
			Для Каждого ПриемникДанныеКлючЗначение Из ДанныеСообщенияПриемник.Данные Цикл
				
				Если ПриемникДанныеКлючЗначение.Ключ <> SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения()Тогда
				
					РазмерДанных = РазмерДанных + ПриемникДанныеКлючЗначение.Значение.Данные.Количество();
					Если РазмерДанных >= МаксимальныйРазмерПакета Тогда
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Пакеты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Неопределено);
			
			// Если размер данных превысил максимальный
			Если РазмерДанных >= МаксимальныйРазмерПакета Тогда
				
				ДанныеСообщенияПриемник.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON;
				ДанныеСообщенияПриемник.Сворачивать = Ложь;
				
				ПараметрыСборки = SUI_ПакетыДанных.ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(ДанныеСообщенияПриемник.Данные);
				ЗаполнитьЗначенияСвойств(ПараметрыСборки, ДанныеСообщенияПриемник);
				
				// Собрать пакеты в JSON
				Пакеты = SUI_ПакетыДанных.СобратьСообщениеПакетаДанныхИзКоллекции(ПараметрыСборки);
				
				ОбщегоНазначенияКлиентСервер.Проверить(Пакеты.Количество() > 0,
					НСтр("ru = 'Не удалось собрать пакет данных'"));
				
				ДанныеСообщенияПриемник.Данные = Пакеты[0];
				
			КонецЕсли;
			
			ДополнительныеПараметрыЗаписи = Новый Структура("МеткаВремени, ДатаЗаписи, Сворачивать");
			ЗаполнитьЗначенияСвойств(ДополнительныеПараметрыЗаписи, ДанныеСообщенияПриемник);
			
			// Обновить данные сообщения Приемник
			Если РегистрыСведений.SUI_СообщенияОбменаДанными.ОбновитьСообщение(ДанныеСообщенияПриемник.ID, ДанныеСообщенияПриемник) Тогда
				
				// Удалить сообщение Источник
				РегистрыСведений.SUI_СообщенияОбменаДанными.Удалить(ДанныеСообщенияИсточник.ID, 
					ДанныеСообщенияИсточник.Отправитель, ДанныеСообщенияИсточник.Получатель);
				
				// Записать остатки пакетов
				Для индекс = 1 По Пакеты.ВГраница() Цикл
					
					ДополнительныеПараметрыЗаписи.МеткаВремени = ДополнительныеПараметрыЗаписи.МеткаВремени+1;
					
					РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, 
						ПараметрыСборки.Получатель, Пакеты[индекс], ПараметрыСборки.Приоритет, ПараметрыСборки.ВидДанных,
						ДополнительныеПараметрыЗаписи);
					
				КонецЦикла;
				
			КонецЕсли;
			
			//@skip-check query-in-loop
			РезультатЗапроса = Запрос.Выполнить();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбработатьДанныеВходящегоСообщения(Знач ДанныеВходящегоСообщения, АдресРезультата) Экспорт
	
	Попытка
		
		ДанныеВходящегоСообщения = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДанныеВходящегоСообщения);
		
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеВходящегоСообщения, "destination", "", Тип("Строка")),
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеВходящегоСообщения, "params", Новый Массив(), Тип("ФиксированныйМассив")));
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Обработка входящего сообщения'")), , 
			Метаданные.ОбщиеМодули.SUI_СообщенияОбменаДанными, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Пакеты данных'") + ?(ПустаяСтрока(ВложенноеСобытие), "", ". " + ВложенноеСобытие);
КонецФункции

Функция СостоянияМобильныхУстройствДляСвертки()
	
	Возврат SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Перечисления.SUI_СостоянияМобильныхУстройств.Выгружено,
		Перечисления.SUI_СостоянияМобильныхУстройств.ТребуетсяПолучитьДанные,
		Перечисления.SUI_СостоянияМобильныхУстройств.Ошибка);
	
КонецФункции

#Область ВходящиеСообщения

Процедура ОбработатьВходящиеСообщения()
	
	// Удалить устаревшие результаты
	ВыполнитьОчисткуУстаревшихРезультатовСообщенийОбменаДанными();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	ID,
		|	Отправитель,
		|	Получатель,
		|	Данные,
		|	ВидДанных,
		|	ДатаЗаписи,
		|	Приоритет,
		|	Сворачивать
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными
		|ГДЕ
		|	Отправитель <> &ЭтотУзел
		|	И Получатель = &ЭтотУзел
		|	И ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.XML)
		|	И НЕ НеОбрабатывать
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрСведений.SUI_СообщенияОбменаДанными";
	
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел());
	
	ПрерватьОбработку = Ложь;
	
	Пока Не ПрерватьОбработку Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			//@skip-check query-in-loop
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				ПрерватьОбработку = Истина;
			Иначе
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					РезультатОбработки = РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.СтруктураРезультатаОбработки(Выборка.ID);
					
					ДанныеСообщения = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Выборка.Данные.Получить());
					
					Если Не ПустаяСтрока(ДанныеСообщения) Тогда
						
						ЗапуститьОбработкуДанныхВходящегоСообщения(ДанныеСообщения, РезультатОбработки);
						
					КонецЕсли;
					
					// Сохранить сообщение обмена данными
					СообщениеОбмена = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
					СообщениеОбмена.Вставить("Данные", ДанныеСообщения);
					РезультатОбработки.СообщениеОбменаДанными = Новый ХранилищеЗначения(СообщениеОбмена, Новый СжатиеДанных(9));
					
					РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.Зафиксировать(РезультатОбработки);
					
				КонецЦикла;
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Обработка входящих сообщений'")), , 
				Метаданные.ОбщиеМодули.SUI_СообщенияОбменаДанными, , ИнформацияОбОшибке());
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапуститьОбработкуДанныхВходящегоСообщения(ДанныеСообщения, РезультатОбработки)
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне();
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = Неопределено;
	ПараметрыВыполненияВФоне.ЗапуститьВФоне = Ложь;
	ПараметрыВыполненияВФоне.ЗапуститьНеВФоне = Ложь;
	ПараметрыВыполненияВФоне.ПрерватьВыполнениеЕслиОшибка = Истина;
	ПараметрыВыполненияВФоне.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = СтрШаблон(
		НСтр("ru = '%1: Обработка входящего сообщения обмена данными'"), SUI_SimpleКлиентСервер.Представление());
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
		"SUI_СообщенияОбменаДанными.ОбработатьДанныеВходящегоСообщения", 
		ДанныеСообщения,
		ПараметрыВыполненияВФоне);
	
	ЗаполнитьЗначенияСвойств(РезультатОбработки, Результат, , "Сообщения");
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			РезультатОбработки.Сообщения.Добавить(Результат.Сообщения[индекс].Текст);
		КонецЦикла;
		
	Иначе
		
		Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
			РезультатОбработки.Сообщения.Добавить(Сообщение.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатОбработки.Обработано = (РезультатОбработки.Статус <> "Выполняется");
	
	Если ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОчисткуУстаревшихРезультатовСообщенийОбменаДанными()
	
	РезультатЗапроса = РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.ПолучитьРезультатЗапросаУстаревшихРезультатов();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне();
		ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "40fb9573-52d8-4485-8aef-b9eb71f4d63a";
		ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = СтрШаблон(
			НСтр("ru = '%1: Удаление устаревших результатов обработки сообщений обмена данными'"), SUI_SimpleКлиентСервер.Представление());
		ПараметрыВыполненияВФоне.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
		
		ДлительныеОперации.ВыполнитьВФоне(
			"РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.ВыполнитьОчисткуУстаревшихРезультатов", 
			Неопределено, ПараметрыВыполненияВФоне);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИсходящиеСообщения

Процедура СформироватьИсходящиеСообщения()
	
	СостоянияЗапросаПолнойВыгрузки = РегистрыСведений.SUI_СостоянияМобильныхУстройств.СостоянияМобильныхУстройств(
		Новый Структура("Состояние", Перечисления.SUI_СостоянияМобильныхУстройств.ЗапросПолнойВыгрузки), Истина);
	
	// Запустить в фоне формирование сообщений пакетов данных полной выгрузки
	Если Не СостоянияЗапросаПолнойВыгрузки.Пустой() Тогда
		
		ПараметрыВыполнения 							= ДлительныеОперации.ПараметрыВыполненияВФоне();
		ПараметрыВыполнения.КлючФоновогоЗадания 		= Новый УникальныйИдентификатор("33c30293-95a3-402d-9b80-621bade9ed03");
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = '%1: Выполнение полной выгрузки'"), SUI_SimpleКлиентСервер.Представление());
		ПараметрыВыполнения.ОжидатьЗавершение 			= 0;
		ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
		ПараметрыВыполнения.СРасширениямиБазыДанных 	= Истина;
		
		ДлительныеОперации.ВыполнитьВФоне("SUI_ПакетыДанных.ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений", 
			Новый Структура("ЭтоПолнаяВыгрузка", Истина), ПараметрыВыполнения);
		
	КонецЕсли;
	
	// Выполнить формирование сообщений пакетов данных по изменениям
	SUI_ПакетыДанных.ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений(Неопределено, Неопределено);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
